## 8. 데이터 로딩과 저장

In [1]:
# 판다스 넘파이 import 
import pandas as pd 
import numpy as np

In [2]:
# examples 파일 확인 
!dir examples

 C ����̺��� �������� �̸��� �����ϴ�.
 ���� �Ϸ� ��ȣ: 5CB0-9C09

 c:\Users\user\Desktop\pythonwork\python_analysis\examples ���͸�

2022-11-21  ���� 03:01    <DIR>          .
2022-11-21  ���� 03:01    <DIR>          ..
2019-02-17  ���� 12:37                58 ex1.csv
2019-02-17  ���� 12:37                42 ex2.csv
2019-02-17  ���� 05:37               170 ex3.txt
2022-11-21  ���� 03:39               126 out.csv
               4�� ����                 396 ����Ʈ
               2�� ���͸�  109,090,676,736 ����Ʈ ����

In [3]:
# ex1.csv 파일 dataframe 만들기 ( read_csv()  함수 사용 )
df = pd.read_csv("./examples/ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
# read_csv 랑 비슷한거 파라미터 사용 
df = pd.read_table('./examples/ex1.csv' , sep =',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
# ex2.csv 파일은 컬럼 명이 없음 
# 그냥 read_csv 해버리면 상단 데이터가 컬럼명으로 끌려올라감 
# 그래서 header = None 옵션 사용 
df = pd.read_csv('./examples/ex2.csv', header= None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
# names 라는 파라미터는 내가 컬럼명을 지정할수 있게 해줌 
names = ['a', 'b', 'c', 'd', 'message' ]
df = pd.read_csv('./examples/ex2.csv', names = names )
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
# message 컬럼을 인덱스로 사용하기 
df.set_index('message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [8]:
# 컬럼 이름 지정 & 인덱스 이름 지정 한번에 하기 
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv('./examples/ex2.csv', names = names , index_col= 'message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
# 파일이  ex3.txt 처럼 txt 고 여러가지 띄어씌기로 되어있다면? \
# sep = '\s+'  : 공백 1개 이상인 것과 일치시킨다 `` 
df = pd.read_table('./examples/ex3.txt', sep = '\s+')
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [10]:
# csv 파일 저장하기 
df.to_csv('./examples/out.csv', index =False )

## 9. 데이터 정제 및 준비

### 9.1 누락된 데이터 처리하기

- 결측치 골라내기

In [11]:
# Nan 값 골라내기

In [12]:
# 에제 시리즈 타입 만들기 
string_data = pd.Series(['abc', 'def', np.nan , 'ghi'])
string_data

0    abc
1    def
2    NaN
3    ghi
dtype: object

In [13]:
# Nan값 있는지 확인 // 있으면 True 
pd.isnull(string_data)  # 1번 
string_data.isnull()    # 2번

0    False
1    False
2     True
3    False
dtype: bool

In [14]:
# 파이썬의 NoneType 자료형  //이거도 판다스에서 null 로 인식함   
type(None)

NoneType

In [15]:
# 불리안 색인 하기 
# 예제 시리즈타입
data = pd.Series([1, np.nan , 3.5 , np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
# True or False 로 만들기 
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [17]:
# True 인 놈 찾기 
data[data.isnull()].index

Int64Index([1, 3], dtype='int64')

In [18]:
# Null 값인 행 삭제하고 싶을때 그 인덱스값을 구해서 
# drop 함수 사용하기 
data.drop([1,3])

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
# 불리안 색인 해서 Nan 값 drop  한번에 하기 
null_idx = data[data.isnull()].index
data.drop(null_idx)

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
# dropna() // null 인 행을 바로 삭제 함 
# 위에꺼를 더 편하게 하는것 

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
# dropna() 예제 데이터프레임 
data = pd.DataFrame([[1.0, 6.5, 3.0],
                     [1.0, np.nan, np.nan],
                     [np.nan, np.nan, np.nan],
                     [np.nan, 6.0, 3.0]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [22]:
# dropna() 는 기본 axis =0 , how = 'any' 임 
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [23]:
# 행 축으로 null 하나라도 있으면 다 삭제하기 
data.dropna(axis = 0, how = 'any')

     0    1    2
0  1.0  6.5  3.0

In [24]:
# 행축으로 값이 다 null 이면 삭제하기 
data.dropna(axis =0 , how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [25]:
# 한 열 Nan 값으로 챙우기 
data[100] = np.nan 
data

   0    1    2    100
0  1.0  6.5  3.0  NaN
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.0  3.0  NaN

In [26]:
# 열 축으로 값이 다 null 이면 삭제하기 
data.dropna(axis = 1 , how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [27]:
# 열 축으로 값이 하나라도 null 이면 삭제하기 
data.dropna(axis =1 , how = 'any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [52]:
# 데이터 프레임에서 dropna() 사용해보기 
# 예제 데이터 프레임 
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.006016 -0.362115  0.181892
1  0.101885 -0.902029 -0.017838
2 -1.585944  1.938299 -0.539550
3  2.465373 -0.657445 -0.588652
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [53]:
# (0,1) ~ (4,1) 랑 (0,2)~ (1,2) 까지 null 값 만들기 
df.iloc[0:4, 1] = np.nan
df.iloc[0:2, 2] = np.nan
df

          0         1         2
0 -0.006016       NaN       NaN
1  0.101885       NaN       NaN
2 -1.585944       NaN -0.539550
3  2.465373       NaN -0.588652
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [54]:
# dropna() 사용하기 
# 행축 
df.dropna()

          0         1         2
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [55]:
# 열축 
df.dropna(axis = 1)

          0
0 -0.006016
1  0.101885
2 -1.585944
3  2.465373
4 -0.667430
5 -1.788226
6 -1.022809

In [56]:
# thresh 파라미터
# null 이 아닌 데이터가 thresh 개수 미만인 부분만 삭제하기 
df.dropna(axis = 1, thresh= 5 )

          0         2
0 -0.006016       NaN
1  0.101885       NaN
2 -1.585944 -0.539550
3  2.465373 -0.588652
4 -0.667430  0.717705
5 -1.788226  0.787635
6 -1.022809 -1.639634

- 결측치 채우기

In [57]:
# Nan 값을 채운다는 의미

In [58]:
# Nan 값에 0 채우기 
df.fillna(0)

          0         1         2
0 -0.006016  0.000000  0.000000
1  0.101885  0.000000  0.000000
2 -1.585944  0.000000 -0.539550
3  2.465373  0.000000 -0.588652
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [59]:
# 딕셔너리 쓰기 
df.fillna({1: 0 , 2: 0.5})

          0         1         2
0 -0.006016  0.000000  0.500000
1  0.101885  0.000000  0.500000
2 -1.585944  0.000000 -0.539550
3  2.465373  0.000000 -0.588652
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [60]:
# 0 을 채우고 df 에 적용하기 
df.fillna(0, inplace = True )
df

          0         1         2
0 -0.006016  0.000000  0.000000
1  0.101885  0.000000  0.000000
2 -1.585944  0.000000 -0.539550
3  2.465373  0.000000 -0.588652
4 -0.667430  0.909454  0.717705
5 -1.788226  1.165203  0.787635
6 -1.022809 -0.774206 -1.639634

In [71]:
# 예제 데이터 프레임 
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.176705 -0.405067  1.104615
1  0.266184 -0.365584  0.446470
2 -1.199239 -1.537987 -0.274329
3 -1.191137 -0.380348  0.164716
4 -0.584154 -0.751088 -0.076841
5 -0.156495 -1.077975  0.926879

In [74]:
# (2,1) ~ (5,1) 이랑 (4,2) ~ (5,2) 까지 None 값 채우기
df.iloc[2: , 1:2] = np.nan
df.iloc[4: , 2:3] = np.nan
df

          0         1         2
0 -0.176705 -0.405067  1.104615
1  0.266184 -0.365584  0.446470
2 -1.199239       NaN -0.274329
3 -1.191137       NaN  0.164716
4 -0.584154       NaN       NaN
5 -0.156495       NaN       NaN

### 9.2 데이터 변형

- 중복 제거하기

- 값 치환하기

- 축 색인 이름 바꾸기

- 데이터 구간 분할

In [61]:
# 수치 데이터(양적 데이터 ) -> 범주형 데이터(질적데이터 )
ages = [20, 22,25,27,21,23,37,31,61,45,41,32 ] 
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [62]:
# 나이 데이터를 구간을 정해서 나눌거임 

pd.cut(ages ,4 )

# -> 그냥 작은데이터 ~ 큰 데이터 를 4등분 한거임

[(19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64, right]): [(19.959, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [63]:
# 컷팅 구간 직접 나눠 주기 
bins = [18, 25, 35 ,60 ,100] 
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
# 구간별 빈도수 확인 
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [65]:
# 컷팅 구간에 이름 붙이기 
bins = [18, 25, 35 ,60 ,100] 
cats = pd.cut(ages, bins, labels = ['Youth','YoungAdult', 'MidelAged', 'Senior'])
pd.value_counts(cats)

Youth         5
YoungAdult    3
MidelAged     3
Senior        1
dtype: int64

In [66]:
# pd.qcut 사용하기 // value 의 개수 기준 
qcats = pd.qcut(ages ,4 ) 
pd.value_counts(qcats )

(19.999, 22.75]    3
(22.75, 29.0]      3
(29.0, 38.0]       3
(38.0, 61.0]       3
dtype: int64

- 특잇값(바깥값, outlier) 찾고 제외하기

In [67]:
# 에제 랜덤 값 만들기 
df = pd.DataFrame(np.random.randn(1000, 4) )
df

            0         1         2         3
0    0.563329  0.189695  1.227193 -0.924573
1    1.601270 -1.400643  0.374838  1.140350
2    0.994839  0.347514  0.582546  0.912868
3    0.352427 -0.251122  0.138806 -0.484973
4   -0.919209 -2.201965 -1.985062 -0.225469
..        ...       ...       ...       ...
995 -1.302556  0.365493 -0.203483  0.103937
996  0.764005 -1.775714  1.215798  0.666604
997  1.891339 -0.778960 -0.592999 -1.107159
998 -0.327494 -1.683500 -1.705847 -1.612660
999 -1.020365 -0.647401 -1.312337  1.061886

[1000 rows x 4 columns]

In [68]:
# 3보다 큰값을 특이값( 바깥값) 으로 가정하고 해당 값을 3으로 치환해보기

- 더미변수 계산하기(one-hot encoding)

In [69]:
# 예제 데이터 프레임 
df = pd.DataFrame({'fruit' : ['apple', 'apple', 'pear', 'peach', 'pear' ],
                'data' : range(5)} )
df

   fruit  data
0  apple     0
1  apple     1
2   pear     2
3  peach     3
4   pear     4

In [70]:
dummies = pd.get_dummies(df['fruit'], prefix='fruit')
dummies

   fruit_apple  fruit_peach  fruit_pear
0            1            0           0
1            1            0           0
2            0            0           1
3            0            1           0
4            0            0           1